src/Documents/АктРассмотренияВозврата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>АктРассмотренияВозврата</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКСтатусамПроцессаВозвратаОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПроверкиДокументовПокупателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АРВ_СтатусыПроверкиДокументовПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПроверкиДокументовПоставщика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АРВ_СтатусыПроверкиДокументовПоставщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПроверкиБухгалтерией</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АРВ_СтатусыПроверкиБухгалтерией</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВозврата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КодыВозврата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленоСообщениеНаСайт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезоговорочныйВозврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЕИСПОЛЬЗУЮТСЯ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратИзРегиона</Name>
					<Comment>Истина - Регион, Ложь - НН</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяСозданиеСлужебногоЗадания</Name>
					<Comment>0 - нет информации, 1 - да, 2 - не надо</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяСозданиеПерестикеровки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийСайт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаЗаявки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПродажи</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Себестоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентУценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПослеУценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидУценки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыУценки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомпенсации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаВозврата</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПричиныВозврата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦелостностьУпаковки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтсутствуютСледыУстановки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/ВидыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыДенежныхСредств</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыУценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыУценки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбработкаОднойДетали</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ПричиныВозврата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ПричиныВозврата</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Брак</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/АктРассмотренияВозврата/Ext/ManagerModule.bsl
Функция ТекстСообщенияДляСайта(АктСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АктРассмотренияВозвратаТовары.Номенклатура,
	|	АктРассмотренияВозвратаТовары.Номенклатура.Наименование,
	|	АктРассмотренияВозвратаТовары.Номенклатура.Изготовитель КАК Изготовитель,
	|	АктРассмотренияВозвратаТовары.Номенклатура.Артикул КАК Артикул,
	|	АктРассмотренияВозвратаТовары.ЕдиницаИзмерения,
	|	АктРассмотренияВозвратаТовары.Количество,
	|	АктРассмотренияВозвратаТовары.Цена,
	|	АктРассмотренияВозвратаТовары.СтавкаНДС,
	|	АктРассмотренияВозвратаТовары.СуммаНДС,
	|	АктРассмотренияВозвратаТовары.Сумма,
	|	АктРассмотренияВозвратаТовары.ПроцентУценки,
	|	АктРассмотренияВозвратаТовары.ЦенаПослеУценки,
	|	АктРассмотренияВозвратаТовары.ВидУценки,
	|	АктРассмотренияВозвратаТовары.СуммаКомпенсации,
	|	АктРассмотренияВозвратаТовары.ПричинаВозврата,
	|	АктРассмотренияВозвратаТовары.ЦелостностьУпаковки,
	|	АктРассмотренияВозвратаТовары.ОтсутствуютСледыУстановки
	|ИЗ
	|	Документ.АктРассмотренияВозврата.Товары КАК АктРассмотренияВозвратаТовары
	|ГДЕ
	|	АктРассмотренияВозвратаТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", АктСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ИнфДок = "";
	ИнфТовар = "";
	
	Наличные = АктСсылка.ДоговорКонтрагента.ВидОплаты = Перечисления.ВидыДенежныхСредств.Наличные;	
	
	Пока Выборка.Следующий() Цикл
		
		Если Наличные Тогда
			
			Если Выборка.ПроцентУценки = 0 Тогда
				
				Сумма = Выборка.Сумма + Выборка.СуммаКомпенсации;
				//И пересчет НДС от новой суммы.
				
				ИнфТовар = Выборка.НоменклатураНаименование + ", " + Выборка.Изготовитель + ", " + АктСсылка.Артикул + ", в кол-ве " + Выборка.Количество + "шт., " + "по цене - " + Выборка.ЦенаПослеУценки + " на общую сумму-" + Сумма + " руб."
				
			Иначе //«Процент уценки» > 0
				
				ИнфТовар = Выборка.НоменклатураНаименование + ", " + Выборка.Изготовитель+ ", " + Выборка.Артикул + ", в кол-ве " + Выборка.Количество + "шт., " + "по цене с учётом уценки " + Выборка.ПроцентУценки + "% - " + Выборка.ЦенаДеталиПослеУценки  + " на общую сумму-" + Выборка.Сумма + " руб.";
				
			КонецЕсли;
			
		Иначе //(товар приобретался за безналичные)
			
			ИнфДок = "Оформить пакет документов: накладная ТОРГ-12, счет-фактура с НДС 18%, оформленные в 2-х экземплярах на " + АктСсылка.Организация + ".";
			
			Если  Выборка.ПроцентУценки = 0 Тогда
				
				Сумма = Выборка.Сумма + Выборка.СуммаКомпенсации;
				СуммаНДС = Выборка.СуммаНДС;//И пересчет НДС от новой суммы.
				
				ИнфТовар = Выборка.НоменклатураНаименование + ", " + Выборка.Изготовитель+ ", " + Выборка.Артикул + ", в кол-ве " + Выборка.Количество + "шт., " + "по цене - " + Выборка.ЦенаПослеУценки + " руб. на общую сумму - " + Сумма + " руб." + " в том числе НДС - " + СуммаНДС + " руб."
				
			Иначе //(т.е. «Возврат с уценкой»=Истина)
				
				ИнфТовар = Выборка.НоменклатураНаименование + ", "+Выборка.Изготовитель+", "+Выборка.Артикул+", в кол-ве " + Выборка.Количество + "шт., " + "по цене с учётом уценки " + Выборка.ПроцентУценки + "% – "+ Выборка.ЦенаПослеУценки+ " руб. на общую сумму- " + Выборка.Сумма + " руб." + " в том числе НДС- " + Выборка.СуммаНДС + " руб. ";
				
				Если Выборка.ВидУценки = Перечисления.ВидыУценки.ОбработкаОднойДетали Тогда //«Вид уценки» = "Обработка одной детали"
					
					ИнфТовар = ИнфТовар + " Стоимость обработки 1 детали составила " + "Что тут(??)" + " руб.";
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли; //(товар приобретался за безналичные)
		
		Если Выборка.ПричинаВозврата = Перечисления.ПричиныВозврата.Брак Тогда //"«Причина возврата» = «брак, СТО»"
			ИнфДок = ИнфДок + ", акт рекламации СТО, Заказ-наряд СТО с подтверждением оплаты работ";
		КонецЕсли;
		
		Если Выборка.ЦелостностьУпаковки Тогда
			Упаковка = "- Сохранена упаковка и её товарный вид.";
		Иначе
			Упаковка = "- Упаковка отсутствует или потерян её товарный вид.";
		КонецЕсли;
		
		Если Выборка.ОтсутствуютСледыУстановки Тогда
			СледыУст = "- Товар не имеет признаков использования, отсутствуют следы установки, сохранен товарный вид.";
		Иначе
			СледыУст = "- Товар имеет следы установки.";
		КонецЕсли;
		
		
		
	КонецЦикла;
	
	
	
	
	
КонецФункции
